{
    "Home": {
        "name": "Himanshu Kumar Dutt",
        "contactInfo": "Contact information",
        "phoneNumber": "Phone number",
        "githubProfile": "GitHub profile",
        "linkedinProfile": "LinkedIn profile",
        "portfolio": "Portfolio",
        "portfolioWebsite": "Portfolio website",
        "email": "Email",
        "emailAddress": "Email address",
        "aboutMe": "About Me",
        "aboutMeContent": "Hello there, welcome to my generic portfolio, I'm Himanshu, started taking intrest in computer back in middle school, but actually did my first code in highschool with python. I've always been obsessed with tech and find it really facinating, i love to dabble into random areas to se what's going on, currenly split between choosing ML (i hate maths but love internal working) and webdev (got 0 design sense but love to create random stuff).  my techstack is weak as my adhd leads me to choose anything i find cool on youtube (golang and SvelteKit and currently trying out expo) ",
        "education": "Education",
        "educationHistory": "Education history",
        "university": "Guru Gobing Singh Indraprastha University",
        "universityPeriod": "Aug 2021-June 2024",
        "universityDegree": "BCA with minor Specialization in ML and AI",
        "universityCGPA": "Current CGPA: {cgpa}",
        "highSchool": "Kamal Public School Vikaspuri",
        "highSchoolPeriod": "2019 - 2021",
        "highSchoolDegree": "12th CBSE Boards (PCM-CS)",
        "highSchoolGrade": "{grade}%",
        "skills": "Skills",
        "skillsList": "List of skills",
        "languages": "Languages",
        "languageSkills": "JavaScript, TypeScript, Python, Golang",
        "frameworks": "Frameworks",
        "frameworkSkills": "NextJS, SvelteKit, Expo, tRPC",
        "libraries": "Libraries",
        "librarySkills": "ReactJS, ExpressJS, Socket.io, React Native, ShadcnUI, React Router, PayloadCMS, FastAPI, Prisma, Drizzle",
        "databases": "Databases",
        "databaseSkills": "MongoDB, SQL (SQLite, Postgres), Lynxjs",
        "tools": "Tools",
        "toolSkills": "Git/GitHub, VS Code, Vercel, AWS EC2, Neovim (basics), BetterAuth",
        "projects": "Projects",
        "project1Title": "tanstack-dexie-db-collection",
        "project1Tech": "TypeScript, Dexie.js, TanStackDB, IndexedDB",
        "project1Description": [
            "Community-maintained Dexie.js collection for TanStackDB (20+ stars).",
            "Allows pure local first development with help of TanStackDB.",
            "Local handles, autoincremental ids,bulk ops support with batching and external backend support."
        ],
        "project2Title": "CutFast - Text Expansion Extension",
        "project2Tech": "Next.js 15, React, Dexie.js, Browser Extension, PostgreSQL, Better Auth, Vite",
        "project2Description": [
            "Productivity browser extension with keyboard-triggered text expansion (Ctrl+Shift+Space),local-first architecture using IndexedDB for instant access.",
            "Self-hostable admin dashboard that acts as backend with user management thanks to vercel deploy now support.",
            "Used BetterAuth for we auth and jwt for extension to server communication.Data portability with JSON import/export of shortcuts, automatic sync between dashboard and extension."
        ],
        "workExperience": "Work Experience",
        "company1": "SAP Labs India",
        "position1": "Developer Intern",
        "period1": "July 2023 - September 2023",
        "responsibilities1": [
            "Feasibility study on whether live data can have currency conversion for team use case. Used Java and Selenium to rewrite & improve previously written automation testing scripts.",
            "Migration from Java 11 to Java 22 as well as Maven. Created custom reusable scripts to handle different use cases while testing. Reduced testing time to 5min for 3 different websites from 20min+."
        ],
        "company2": "RankFlys",
        "position2": "MERN Stack Developer",
        "period2": "May 2024 - July 2024",
        "responsibilities2": [
            "Worked as freelance developer to create and integrate AI-based NEET and JEE question doubt engine.",
            "Used NodeJS, ExpressJS, NextJS, and Google Gemini 1.5 to create optimized solution with rate limits & authorizations. Created file upload, camera upload, crop mechanism alongside sharp package to reduce file size for optimal performance."
        ],
        "company3": "Nextfly Technologies",
        "position3": "Full Stack Developer",
        "period3": "Jan 2025 - July 2025",
        "responsibilities3": [
            "Engineered plemie - a comprehensive social gigs platform, developing both a responsive web application and a cross-platform mobile app using Expo React Native. Implemented real-time chat functionality using Server-Sent Events (SSE) with tRPC, and a secure payout system with a custom Razorpay X package. Built dedicated dashboards for gig artists and customers.",
            "Engineered fluidpe - a loan application platform, developing the customer-facing mobile experience using Expo React Native, tRPC, and React Query with Zustand for state management. Integrated OneSignal for real-time notifications. Created end to end loan application flow using finsire as well as helped created multiple dashboard for different role users.",
            "Contributed to the MyDeer project by restructuring the mobile app's architecture within a monorepo. Provided initial development support for the Scraplo mobile app, creating foundational tab and sidebar navigation."
        ],
        "certificates": "Certificates",
        "certificatesList": "Generative AI | ML | Python | Golang"
    }
}