{
  "Home": {
    "name": "Himanshu Kumar Dutt",
    "contactInfo": "Contact information",
    "phoneNumber": "Phone number",
    "githubProfile": "GitHub profile",
    "linkedinProfile": "LinkedIn profile",
    "portfolio": "Portfolio",
    "portfolioWebsite": "Portfolio website",
    "email": "Email",
    "emailAddress": "Email address",
    "aboutMe": "About Me",
    "aboutMeContent": "Hello there, welcome to my generic portfolio, I'm Himanshu, started taking intrest in computer back in middle school, but actually did my first code in highschool with python. I've always been obsessed with tech and find it really facinating, i love to dabble into random areas to se what's going on, currenly split between choosing ML (i hate maths but love internal working) and webdev (got 0 design sense but love to create random stuff).  my techstack is weak as my adhd leads me to choose anything i find cool on youtube (golang and SvelteKit and currently trying out expo) ",
    "education": "Education",
    "educationHistory": "Education history",
    "university": "Guru Gobing Singh Indraprastha University",
    "universityPeriod": "Aug 2021-June 2024",
    "universityDegree": "BCA with minor Specialization in ML and AI",
    "universityCGPA": "Current CGPA: {cgpa}",
    "highSchool": "Kamal Public School Vikaspuri",
    "highSchoolPeriod": "2019 - 2021",
    "highSchoolDegree": "12th CBSE Boards (PCM-CS)",
    "highSchoolGrade": "{grade}%",
    "skills": "Skills",
    "skillsList": "List of skills",
    "languages": "Languages",
    "languageSkills": "JavaScript, TypeScript, Python, Golang, HTML/CSS",
    "frameworks": "Frameworks",
    "frameworkSkills": "NextJS, SvelteKit, Expo",
    "libraries": "Libraries",
    "librarySkills": "ReactJS, ExpressJS, Socket.io, React Native, ShadcnUI, React Router,payloadCMS",
    "databases": "Databases",
    "databaseSkills": "MongoDB, SQL (SQLite, Postgres)",
    "tools": "Tools",
    "toolSkills": "Git/GitHub, VS Code, Vercel, AWS EC2, Neovim (basics)",
    "projects": "Projects",

    "project1Title": "SteelOnMobile - Steel Products Management System",
    "project1Tech": "Next.js 14, React 18, TypeScript, Tailwind CSS, MongoDB, Mongoose, JWT, UploadThing, Radix UI, Zustand",
    "project1Description": [
      "Modern web app for steel product management with an intuitive admin dashboard and responsive user interface, built on Next.js 14 and React 18.",
      "Implements a multi-level categorization system (Category > Subcategory > Type > Dimension) with secure JWT authentication and role-based access control.",
      "Features drag-and-drop file uploads, real-time search/filtering, and a responsive design using Tailwind CSS and Radix UI components.",
      "Leverages MongoDB with Mongoose for efficient data modeling and Zustand for client-side state management."
    ],

    "project2Title": "Create Vite Starter TS · Create Express Starter TS",
    "project2Tech": "@clack/prompts, consola, execa, fs-extra, gradient-string, react, jsonc-parser, picocolors, typescript",
    "project2Description": [
      "CLI to scaffold a modern Vite + React + TypeScript app with Tailwind, shadcn/ui, ESLint and absolute imports; includes a React Router v7 Data APIs add-on.",
      "Companion CLI for Express: choose Basic or Advanced template with API v1, controllers/routes/schemas, Zod validation (express-zod-safe), Better Auth (req.auth, guards), Drizzle ORM, and Swagger docs at /docs/v1.",
      "Interactive prompts for project directory, template choice, Git init, and dependency installation; detects npm/yarn/pnpm/bun.",
      "Type-safe templates and strong DX utilities; clear folder structures and ready-to-run scripts."
    ],
    "workExperience": "Work Experience",
    "company1": "SAP Labs India",
    "position1": "Developer Intern",
    "period1": "July 2023 - September 2023",
    "responsibilities1": [
      "Feasibility study on whether live data can have currency conversion for team use case.",
      "Used Java and Selenium to rewrite & improve previously written automation testing scripts.",
      "Migration from Java 11 to Java 22 as well as Maven. Created custom reusable scripts to handle different use cases while testing. Reduced testing time to 5min for 3 different websites from 20min+."
    ],
    "company2": "RankFlys",
    "position2": "MERN Stack Developer",
    "period2": "May 2024 - July 2024",
    "responsibilities2": [
      "Worked as freelance developer to create and integrate AI-based NEET and JEE question doubt engine.",
      "Used NodeJS, ExpressJS, NextJS, and Google Gemini 1.5 to create optimized solution with rate limits & authorizations.",
      "Created file upload, camera upload, crop mechanism alongside sharp package to reduce file size for optimal performance."
    ],
    "company3": "Nextfly Technologies",
    "position3": "Full Stack Developer",
    "period3": "Jan 2025 - July 2025",
    "responsibilities3": [
      "Responsible for building plemie a multi tenant platform for social gigs. Used turborepo to build customer facing, admin facing and seller facing dashboard. Real-time chat with Server Sent Events. Integrated payout system with Razorpay. Built cross platform React Native app with Expo. Added role based admin to admin management.",
      "Used payload CMS to enhance and add new features to admastery.in. Worked with monorepos with NextJS, trpc to build end to end applications.",
      "Updated and migrated old codebase with new React 19 and NextJS 15 features and optimizations.",
      "created multiple fullstack web project monorepo + helped in creation of 2 react native apps."
    ],
    "certificates": "Certificates",
    "certificatesList": "Generative AI | ML | Python | Golang"
  }
}
