{
    "Home": {
        "name": "Himanshu Kumar Dutt",
        "contactInfo": "Información de contacto",
        "phoneNumber": "Número de teléfono",
        "githubProfile": "Perfil de GitHub",
        "linkedinProfile": "Perfil de LinkedIn",
        "portfolio": "Portafolio",
        "portfolioWebsite": "Sitio web del portafolio",
        "email": "Correo electrónico",
        "emailAddress": "Dirección de correo electrónico",
        "aboutMe": "Sobre mí",
        "aboutMeContent": " Hola, bienvenido a mi portafolio genérico, soy Himanshu, empecé a interesarme en la computación en la escuela secundaria, pero realmente hice mi primer código en la preparatoria con Python. Siempre he estado obsesionado con la tecnología y la encuentro realmente fascinante, me encanta explorar áreas aleatorias para ver qué está pasando, actualmente dividido entre elegir ML (odio las matemáticas pero me encanta el funcionamiento interno) y desarrollo web (no tengo sentido del diseño pero me encanta crear cosas aleatorias). mi stack tecnológico es débil ya que mi TDAH me lleva a elegir cualquier cosa que encuentre genial en YouTube (golang y SvelteKit y actualmente probando expo).",
        "education": "Educación",
        "educationHistory": "Historial educativo",
        "university": "Universidad Guru Gobing Singh Indraprastha",
        "universityPeriod": "Agosto 2021-Junio 2024",
        "universityDegree": "BCA con especialización menor en ML y AI",
        "universityCGPA": "CGPA actual: {cgpa}",
        "highSchool": "Escuela Pública Kamal Vikaspuri",
        "highSchoolPeriod": "2019 - 2021",
        "highSchoolDegree": "12º CBSE Boards (PCM-CS)",
        "highSchoolGrade": "{grade}%",
        "skills": "Habilidades",
        "skillsList": "Lista de habilidades",
        "languages": "Lenguajes de programación",
        "languageSkills": "JavaScript, TypeScript, Python, Golang, HTML/CSS",
        "frameworks": "Frameworks",
        "frameworkSkills": "NextJS, SvelteKit",
        "libraries": "Bibliotecas",
        "librarySkills": "ReactJS, ExpressJS, Socket.io, Clerk Auth, Shadcn, NextUI",
        "databases": "Bases de datos",
        "databaseSkills": "MongoDB, SQL (SQLite, Postgres)",
        "tools": "Herramientas",
        "toolSkills": "Git/GitHub, VS Code, Vercel, AWS EC2, Neovim (básico)",
        "projects": "Proyectos",
        "project1Title": "PdfChatBot",
        "project1Tech": "Python, RapidAPI, LangChain, Google Generative AI, TypeScript, ReactJS, ShadCnUI, Tailwind",
        "project1Description": [
            "PdfChatBot es una solución moderna para chatear con cualquier archivo pdf con capacidades de IA. Construido con Python y RapidAPI como columna vertebral con LangChain y la biblioteca de Google Generative AI.",
            "El frontend se construyó con Vite+React para la reacción más rápida y componentes elegantes. Utiliza componentes dinámicos ShadCn para adaptarse a cualquier pantalla.",
            "Utiliza FAISS CPU para embeddings vectoriales y compilación rápida de archivos."
        ],
        "project2Title": "WatchrMV",
        "project2Tech": "SvelteKit, NodeJS, ExpressJS, Axios, WebTorrent, Webtor, TMDB",
        "project2Description": [
            "WatcherMV es un lugar para encontrar una película que quieras ver, experimentó con Webtor para mostrar todas las opciones de visualización posibles de sitios agregados en Internet.",
            "El frontend se construyó con SvelteKit, uno de los frameworks de JavaScript más rápidos a la par con SolidJS con una interfaz de usuario elegante, capacidades de barra de búsqueda, secciones populares y de tendencias. El uso de Tailwind mejora la experiencia de estilo y la facilidad de prototipado.",
            "Utiliza WebTorrent para buscar todas las opciones de transmisión en Internet y mostrar todas las resoluciones para ver."
        ],
        "workExperience": "Experiencia laboral",
        "company1": "SAP Labs India",
        "position1": "Desarrollador Interno",
        "period1": "Julio 2023 - Septiembre 2023",
        "responsibilities1": [
            "Estudio de viabilidad sobre si los datos en vivo pueden tener conversión de moneda para el caso de uso del equipo.",
            "Utilicé Java y Selenium para reescribir y mejorar los scripts de pruebas de automatización escritos previamente.",
            "Migración de Java 11 a Java 22 así como Maven. Creé scripts reutilizables personalizados para manejar diferentes casos de uso durante las pruebas. Reduje el tiempo de prueba a 5 minutos para 3 sitios web diferentes desde más de 20 minutos."
        ],
        "company2": "RankFlys",
        "position2": "Desarrollador MERN Stack",
        "period2": "Mayo 2024 - Julio 2024",
        "responsibilities2": [
            "Trabajé como desarrollador freelance para crear e integrar un motor de preguntas basadas en IA para NEET y JEE.",
            "Utilicé NodeJS, ExpressJS, NextJS y Google Gemini 1.5 para crear una solución optimizada con límites de velocidad y autorizaciones.",
            "Creé un mecanismo de carga de archivos, carga de cámara, mecanismo de recorte junto con el paquete sharp para reducir el tamaño del archivo para un rendimiento óptimo."
        ],
        "certificates": "Certificados",
        "certificatesList": "Generative AI | ML | Python | Golang"
    }
}