{
    "Home": {
        "name": "Himanshu Kumar Dutt",
        "contactInfo": "Informations de contact",
        "phoneNumber": "Numéro de téléphone",
        "githubProfile": "Profil GitHub",
        "linkedinProfile": "Profil LinkedIn",
        "portfolio": "Portfolio",
        "portfolioWebsite": "Site web du portfolio",
        "email": "Email",
        "emailAddress": "Adresse email",
        "aboutMe": "À propos de moi",
        "aboutMeContent": " Bonjour, bienvenue sur mon portfolio générique, je suis Himanshu, j'ai commencé à m'intéresser aux ordinateurs au collège, mais j'ai réellement fait mon premier code au lycée avec Python. J'ai toujours été obsédé par la technologie et je la trouve vraiment fascinante, j'aime explorer des domaines aléatoires pour voir ce qui se passe, actuellement partagé entre choisir ML (je déteste les maths mais j'aime le fonctionnement interne) et webdev (je n'ai aucun sens du design mais j'aime créer des choses aléatoires). ma stack technologique est faible car mon ADHD me pousse à choisir tout ce que je trouve cool sur YouTube (golang et SvelteKit et actuellement en train d'essayer expo).",
        "education": "Éducation",
        "educationHistory": "Historique de l'éducation",
        "university": "Université Guru Gobing Singh Indraprastha",
        "universityPeriod": "Août 2021-Juin 2024",
        "universityDegree": "BCA avec spécialisation mineure en ML et AI",
        "universityCGPA": "CGPA actuel: {cgpa}",
        "highSchool": "École Publique Kamal Vikaspuri",
        "highSchoolPeriod": "2019 - 2021",
        "highSchoolDegree": "12ème CBSE Boards (PCM-CS)",
        "highSchoolGrade": "{grade}%",
        "skills": "Compétences",
        "skillsList": "Liste des compétences",
        "languages": "Langages de programmation",
        "languageSkills": "JavaScript, TypeScript, Python, Golang, HTML/CSS",
        "frameworks": "Frameworks",
        "frameworkSkills": "NextJS, SvelteKit",
        "libraries": "Bibliothèques",
        "librarySkills": "ReactJS, ExpressJS, Socket.io, Clerk Auth, Shadcn, NextUI",
        "databases": "Bases de données",
        "databaseSkills": "MongoDB, SQL (SQLite, Postgres)",
        "tools": "Outils",
        "toolSkills": "Git/GitHub, VS Code, Vercel, AWS EC2, Neovim (bases)",
        "projects": "Projets",
        "project1Title": "PdfChatBot",
        "project1Tech": "Python, RapidAPI, LangChain, Google Generative AI, TypeScript, ReactJS, ShadCnUI, Tailwind",
        "project1Description": [
            "PdfChatBot est une solution moderne pour discuter avec n'importe quel fichier pdf avec des capacités AI. Construit avec Python et RapidAPI comme colonne vertébrale avec LangChain et la bibliothèque Google Generative AI.",
            "Le frontend est construit avec Vite+React pour la réaction la plus rapide et des composants élégants. Utilise des composants dynamiques ShadCn pour s'adapter à n'importe quel écran.",
            "Utilise FAISS CPU pour les embeddings vectoriels et la compilation rapide des fichiers."
        ],
        "project2Title": "WatchrMV",
        "project2Tech": "SvelteKit, NodeJS, ExpressJS, Axios, WebTorrent, Webtor, TMDB",
        "project2Description": [
            "WatcherMV est un endroit pour trouver un film que vous voulez regarder, il a expérimenté avec Webtor pour afficher toutes les options de visionnage possibles à partir de sites agrégés sur Internet.",
            "Le frontend est construit avec SvelteKit, l'un des frameworks JavaScript les plus rapides au même niveau que SolidJS avec une interface utilisateur élégante, des capacités de barre de recherche, des sections populaires et tendances. L'utilisation de Tailwind améliore l'expérience de style et la facilité de prototypage.",
            "Utilise WebTorrent pour rechercher toutes les options de streaming sur Internet et afficher toutes les résolutions pour regarder."
        ],
        "workExperience": "Expérience professionnelle",
        "company1": "SAP Labs India",
        "position1": "Stagiaire Développeur",
        "period1": "Juillet 2023 - Septembre 2023",
        "responsibilities1": [
            "Étude de faisabilité pour savoir si les données en direct peuvent avoir une conversion de devises pour le cas d'utilisation de l'équipe.",
            "Utilisé Java et Selenium pour réécrire et améliorer les scripts de test d'automatisation écrits précédemment.",
            "Migration de Java 11 à Java 22 ainsi que Maven. Créé des scripts réutilisables personnalisés pour gérer différents cas d'utilisation lors des tests. Réduction du temps de test à 5 minutes pour 3 sites web différents à partir de plus de 20 minutes."
        ],
        "company2": "RankFlys",
        "position2": "Développeur MERN Stack",
        "period2": "Mai 2024 - Juillet 2024",
        "responsibilities2": [
            "Travaillé en tant que développeur freelance pour créer et intégrer un moteur de questions NEET et JEE basé sur l'AI.",
            "Utilisé NodeJS, ExpressJS, NextJS et Google Gemini 1.5 pour créer une solution optimisée avec des limites de taux et des autorisations.",
            "Créé un mécanisme de téléchargement de fichiers, de téléchargement par caméra, de recadrage avec le package sharp pour réduire la taille des fichiers pour des performances optimales."
        ],
        "certificates": "Certificats",
        "certificatesList": "Generative AI | ML | Python | Golang"
    }
}