{
    "Home": {
        "name": "हिमांशु कुमार दत्त",
        "contactInfo": "संपर्क जानकारी",
        "phoneNumber": "फोन नंबर",
        "githubProfile": "GitHub प्रोफाइल",
        "linkedinProfile": "LinkedIn प्रोफाइल",
        "portfolio": "पोर्टफोलियो",
        "portfolioWebsite": "पोर्टफोलियो वेबसाइट",
        "email": "ईमेल",
        "emailAddress": "ईमेल पता",
        "aboutMe": "मेरे बारे में",
        "aboutMeContent": "नमस्ते, मेरे जेनेरिक पोर्टफोलियो में आपका स्वागत है...",
        "education": "शिक्षा",
        "educationHistory": "शैक्षिक इतिहास",
        "university": "गुरु गोबिंद सिंह इंद्रप्रस्थ विश्वविद्यालय",
        "universityPeriod": "अगस्त 2021-जून 2024",
        "universityDegree": "एमएल और एआई में माइनर स्पेशलाइजेशन के साथ बीसीए",
        "universityCGPA": "वर्तमान सीजीपीए: {cgpa}",
        "highSchool": "कमल पब्लिक स्कूल विकासपुरी",
        "highSchoolPeriod": "2019 - 2021",
        "highSchoolDegree": "12वीं सीबीएसई बोर्ड (पीसीएम-सीएस)",
        "highSchoolGrade": "{grade}%",
        "skills": "कौशल",
        "skillsList": "कौशल की सूची",
        "languages": "भाषाएँ",
        "languageSkills": "जावास्क्रिप्ट, टाइपस्क्रिप्ट, पाइथन, गोलांग, HTML/CSS",
        "frameworks": "फ्रेमवर्क्स",
        "frameworkSkills": "NextJS, SvelteKit",
        "libraries": "लाइब्रेरीज़",
        "librarySkills": "ReactJS, ExpressJS, Socket.io, Clerk Auth, Shadcn, NextUI",
        "databases": "डेटाबेस",
        "databaseSkills": "MongoDB, SQL (SQLite, Postgres)",
        "tools": "टूल्स",
        "toolSkills": "Git/GitHub, VS Code, Vercel, AWS EC2, Neovim (बेसिक्स)",
        "projects": "प्रोजेक्ट्स",
        "project1Title": "PdfChatBot",
        "project1Tech": "पाइथन, RapidAPI, LangChain, Google Generative AI, टाइपस्क्रिप्ट, ReactJS, ShadCnUI, Tailwind",
        "project1Description": [
            "PdfChatBot किसी भी PDF फाइल के साथ AI क्षमताओं के साथ चैट करने का एक आधुनिक समाधान है। पाइथन और RapidAPI को LangChain और Google Generative AI लाइब्रेरी के साथ बैकबोन के रूप में बनाया गया है।",
            "फ्रंटएंड Vite+React के साथ सबसे तेज प्रतिक्रिया और स्लीक कंपोनेंट्स के लिए बनाया गया है। किसी भी स्क्रीन के अनुकूल होने के लिए ShadCn के डायनामिक कंपोनेंट्स का उपयोग करता है।",
            "वेक्टर एम्बेडिंग्स और फाइलों के त्वरित संकलन के लिए FAISS CPU का उपयोग करता है।"
        ],
        "project2Title": "WatchrMV",
        "project2Tech": "SvelteKit, NodeJS, ExpressJS, Axios, WebTorrent, Webtor, TMDB",
        "project2Description": [
            "WatcherMV एक ऐसी जगह है जहां आप ब्राउज़ करने के लिए एक फिल्म खोज सकते हैं, यह Webtor के साथ प्रयोग किया गया है ताकि इंटरनेट पर एकत्रित साइटों से सभी संभावित देखने के विकल्प प्रदर्शित किए जा सकें।",
            "फ्रंटएंड SvelteKit के साथ बनाया गया है, जो SolidJS के समान सबसे तेज़ जावास्क्रिप्ट फ्रेमवर्क में से एक है, जिसमें स्लीक UI, सर्च बार क्षमताएं, लोकप्रिय और ट्रेंडिंग सेक्शन हैं। Tailwind का उपयोग स्टाइलिंग अनुभव और प्रोटोटाइप करने की सुगमता को बढ़ाता है।",
            "इंटरनेट पर सभी स्ट्रीमिंग विकल्पों की खोज करने और देखने के लिए सभी रिज़ॉल्यूशन प्रदर्शित करने के लिए WebTorrent का उपयोग करता है।"
        ],
        "workExperience": "कार्य अनुभव",
        "company1": "SAP लैब्स इंडिया",
        "position1": "डेवलपर इंटर्न",
        "period1": "जुलाई 2023 - सितंबर 2023",
        "responsibilities1": [
            "टीम के उपयोग के मामले के लिए लाइव डेटा में मुद्रा परिवर्तन हो सकता है या नहीं, इस पर व्यवहार्यता अध्ययन।",
            "पहले से लिखी गई ऑटोमेशन टेस्टिंग स्क्रिप्ट्स को फिर से लिखने और सुधारने के लिए जावा और सेलेनियम का उपयोग किया।",
            "जावा 11 से जावा 22 के साथ-साथ Maven में माइग्रेशन। परीक्षण करते समय विभिन्न उपयोग मामलों को संभालने के लिए कस्टम पुन: प्रयोज्य स्क्रिप्ट बनाई। 3 अलग-अलग वेबसाइटों के लिए परीक्षण समय को 20 मिनट+ से घटाकर 5 मिनट कर दिया।"
        ],
        "company2": "RankFlys",
        "position2": "MERN स्टैक डेवलपर",
        "period2": "मई 2024 - जुलाई 2024",
        "responsibilities2": [
            "AI-आधारित NEET और JEE प्रश्न संदेह इंजन बनाने और एकीकृत करने के लिए फ्रीलांस डेवलपर के रूप में काम किया।",
            "दर सीमाओं और प्राधिकरणों के साथ अनुकूलित समाधान बनाने के लिए NodeJS, ExpressJS, NextJS और Google Gemini 1.5 का उपयोग किया।",
            "इष्टतम प्रदर्शन के लिए फाइल आकार को कम करने के लिए sharp पैकेज के साथ-साथ फाइल अपलोड, कैमरा अपलोड, क्रॉप मैकेनिज्म बनाया।"
        ],
        "certificates": "प्रमाणपत्र",
        "certificatesList": "जेनरेटिव AI | ML | पाइथन | गोलांग"
    }
}