{
  "Home": {
    "name": "Himanshu Kumar Dutt",
    "contactInfo": "Informasi Kontak",
    "phoneNumber": "Nomor Telepon",
    "githubProfile": "Profil GitHub",
    "linkedinProfile": "Profil LinkedIn",
    "portfolio": "Portofolio",
    "portfolioWebsite": "Situs Web Portofolio",
    "email": "Email",
    "emailAddress": "Alamat Email",
    "aboutMe": "Tentang Saya",
    "aboutMeContent": "Halo, selamat datang di portofolio saya. Saya Himanshu. Saya mulai tertarik dengan komputer sejak sekolah menengah pertama, tetapi sebenarnya saya membuat kode pertama saya di sekolah menengah atas dengan Python. Saya selalu terobsesi dengan teknologi dan menganggapnya sangat menarik. Saya suka mencoba-coba bidang acak untuk melihat apa yang sedang terjadi. Saat ini saya sedang mengerjakan pengembangan web (suka membuat hal-hal acak). Tumpukan teknologi saya agak acak (maaf sebelumnya) karena ADHD membuat saya memilih apa pun yang saya anggap keren di YouTube (golang, SvelteKit, dan saat ini sedang mencoba expo untuk aplikasi android), tetapi saya sangat menyukai nextJS.",
    "education": "Pendidikan",
    "educationHistory": "Riwayat Pendidikan",
    "university": "Universitas Guru Gobing Singh Indraprastha",
    "universityPeriod": "Agustus 2021-Juni 2024",
    "universityDegree": "BCA dengan Spesialisasi minor di ML dan AI",
    "universityCGPA": "CGPA Saat Ini: {cgpa}",
    "highSchool": "Sekolah Umum Kamal Vikaspuri",
    "highSchoolPeriod": "2019 - 2021",
    "highSchoolDegree": "12th CBSE Boards (PCM-CS)",
    "highSchoolGrade": "{grade}%",
    "skills": "Keterampilan",
    "skillsList": "Daftar Keterampilan",
    "languages": "Bahasa Pemrograman",
    "languageSkills": "JavaScript, TypeScript, Python, Golang, HTML/CSS",
    "frameworks": "Framework",
    "frameworkSkills": "NextJS, SvelteKit",
    "libraries": "Library",
    "librarySkills": "ReactJS, ExpressJS, Socket.io, Clerk Auth, Shadcn, NextUI",
    "databases": "Basis Data",
    "databaseSkills": "MongoDB, SQL (SQLite, Postgres)",
    "tools": "Alat",
    "toolSkills": "Git/GitHub, VS Code, Vercel, AWS EC2, Neovim (dasar)",
    "projects": "Proyek",
    "project1Title": "PdfChatBot",
    "project1Tech": "Python, RapidAPI, LangChain, Google Generative AI, TypeScript, ReactJS, ShadCnUI, Tailwind",
    "project1Description": [
      "PdfChatBot adalah solusi modern untuk berbicara dengan file pdf apa pun dengan kemampuan AI. Dibangun dengan Python dan RapidAPI sebagai tulang punggung dengan LangChain dan perpustakaan Google Generative AI.",
      "Frontend dibangun dengan Vite+React untuk reaksi tercepat dan komponen ramping. Menggunakan komponen dinamis ShadCn untuk beradaptasi dengan layar apa pun.",
      "Menggunakan FAISS CPU untuk embedding vektor dan kompilasi cepat file."
    ],
    "project2Title": "WatchrMV",
    "project2Tech": "SvelteKit, NodeJS, ExpressJS, Axios, WebTorrent, Webtor, TMDB",
    "project2Description": [
      "WatcherMV adalah satu tempat untuk menemukan film yang ingin Anda tonton, bereksperimen dengan Webtor untuk menampilkan semua opsi menonton dari situs teragregasi di internet.",
      "Frontend dibangun dengan SvelteKit, salah satu framework JavaScript tercepat setara dengan SolidJS dengan UI ramping, kemampuan bilah pencarian, bagian populer dan tren. Penggunaan Tailwind meningkatkan pengalaman styling dan kemudahan untuk prototipe.",
      "Menggunakan WebTorrent untuk mencari semua opsi streaming di internet, dan menampilkan semua resolusi untuk ditonton."
    ],
    "workExperience": "Pengalaman Kerja",
    "company1": "SAP Labs India",
    "position1": "Magang Pengembang",
    "period1": "Juli 2023 - September 2023",
    "responsibilities1": [
      "Studi kelayakan apakah data langsung dapat memiliki konversi mata uang untuk kasus penggunaan tim.",
      "Menggunakan Java dan Selenium untuk menulis ulang & meningkatkan skrip pengujian otomatisasi yang ditulis sebelumnya.",
      "Migrasi dari Java 11 ke Java 22 serta Maven. Membuat skrip yang dapat digunakan kembali untuk menangani berbagai kasus penggunaan saat pengujian. Mengurangi waktu pengujian menjadi 5 menit untuk 3 situs web berbeda dari 20 menit lebih."
    ],
    "company2": "RankFlys",
    "position2": "Pengembang MERN Stack",
    "period2": "Mei 2024 - Juli 2024",
    "responsibilities2": [
      "Bekerja sebagai pengembang lepas untuk membuat dan mengintegrasikan mesin keraguan pertanyaan berbasis AI NEET dan JEE.",
      "Menggunakan NodeJS, ExpressJS, NextJS, dan Google Gemini 1.5 untuk membuat solusi yang dioptimalkan dengan batasan tingkat & otorisasi.",
      "Membuat mekanisme unggah file, unggah kamera, pemotongan bersama paket sharp untuk mengurangi ukuran file untuk kinerja optimal."
    ],
    "certificates": "Sertifikat",
    "certificatesList": "Generative AI | ML | Python | Golang"
  }
}
